// المحميات الطبيعية
const locations1 = [
  { id: 1, title: 'محمية رأس محمد', lat: 27.750099358589004, lng: 34.238449824600636, description: 'تقع بجنوب سيناء تحديدا على بعد 12 كم من شرم الشيخ. يجاور خليج العقبة إلى الشرق وتجاور خليج السويس إلى الغرب. أسست في عام 1983. الغوص والسباحة هي انشطه شعبية في رأس محمد' },
  { id: 2, title: 'محمية الزرانيق', lat: 31.11605724892604, lng: 33.400143367053325, description: "تقع محمية الزرانيق الطبيعية فى الجزء الشرقى من بحيرة البردويل على مسافة حوالى 25 كيلو مترًا غرب مدينة العريش، وتغطى حوالى 250 كيلو مترًا مربعًا  وتشتهر محمية الزرانيق بأنها مكان لتجمع الطيور المهاجرة من قارة أوروبا باتجاه آسيا وأفريقيا عبر سيناء، تأتي إلى المحمية خلال هجرتها من أوروبا قاطعة البحر الأبيض المتوسط في طريقها إلى أفريقيا وآسيا، وهواة الصيد في سيناء ينتظرون موسم الخريف من كل عام لبدء صيد الطيور" },
  { id: 3, title: 'محمية سانت كاترين', lat: 28.552459761230303, lng: 33.96566262737444, description: 'محمية طبيعية وثقافية تقع علي هضبة مرتفعة في جنوب سيناء، تحيط بها جبال شاهقة وتبلغ مساحتها حوالي 4250 كم2. وأعلنت محمية عام 1988 وتم تفعيل العمل بالمحمية عام 1996' },
  { id: 4, title: 'محمية طابا', lat: 29.494465484484625, lng: 34.89368366375281, description: 'بلدة حدودية علي الحدود المصرية الفلسطينية وآخر جزء محرر من التراب المصري ومساحتها 3500 كيلو متر المربع، يوجد بها العديد من الحيوانات المهددة بالانقراض وتكثر بها الشعاب المرجانية النادرة لذلك اعتبرتها الحكومة المصرية منذ أن تسلمتها من الاحتلال الإسرائيلي سنة 1989 م محمية طبيعية' },
  { id: 5, title: 'محمية نبق', lat: 28.121532708950483, lng: 34.44106149577727, description: 'تتميز نبق بتعدد الأنظمة البيئية فتتمتع ببيئة صحراوية جبلية بكثبانها الرملية عند وادي كيد تتخللها وديان زاخرة بنباتات طبيعية بالإضافة إلى نباتات المانجروف (أفيسينيا مارينا) هذا وقاع الخليج بهذه المنطقة به العديد من الشعاب المرجانية والأسماك الملونة واللافقاريات والمحاريات والحياة البرية بها ثمينة حيث يوجد بها الغزلان، الإبل النوبي، التياتل، الثعالب، الوبر والعديد من أنواع القوارض والزواحف كما تهاجر إليها أنواع الطيور مثل العقاب النسارية، والخواضات، طائر البلشون' },
  { id: 6, title: 'محمية ابو جالوم', lat: 28.73218338576485, lng: 34.625387238126166, description: 'محمية طبيعية متعددة الأغراض. تقع بمحافظة جنوب سيناء في مصر، تطل على خليج العقبة على الطريق بين شرم الشيخ وطابا بمنطقة تسمي وادي الرساسة، وقد أعلنت كمحمية بموجب قرار السيد رئيس مجلس الوزراء رقم 1511 لسنة 1992 والمعدل بالقرار رقم 33 لسنة 1996. تتميز بطبوغرافية خاصة تقترب فيها الجبال من الشواطئ، كما تشتهر المحمية بوجود نظام كهفي تحت الماء الذي يمتد لأعماق تصل لأكثر من 100 م إلا أنه غير مستقر' },
  { id: 7, title: 'محمية وادي جيرافى', lat: 29.125818397525748, lng: 33.49782091115968, description: 'وادي الجرافي، هو وادي يمرّ عبر جبال النقب فيقسمها لقسمين، وحدة شمالية ووحدة جنوبية هو من أبرز الروافد الشمالية لوادي عربة حيث يحمل إليه مياه السيول من جبال سماوة أو سماوي ومن شرق شبه جزيرة سيناء ' },
]

// المواقع التاريخية و الأثرية
const locations2 = [
  { id: 1, title: 'قلعة العريش', lat: 31.122018205510255, lng: 33.79825826705369, description: 'بنيت على هضبة جنوب غرب العريش على أنقاض قلعة فرعونية قديمة ، ويرجع الفضل فى إعادة بنائها للسلطان التركى سليمان القانونى عام 1560م ، وتجرى بها حالياً أعمال الكشف والتنقيب لتحويلها الى مزار سياحى.' },
  { id: 2, title: 'قلعة نخل', lat: 29.90061069215976, lng: 33.750709509333205, description: 'هى من القلاع الحربية المشرفة على طريق الحـج القديم بمدينة نخل - شيدها السلطان المملوكى قنصوة الغورى عام 1516م لتأمين طريق الحج الى بيت الله الحرام .' },
  // { id: 3, title: 'قلعة المغارة', lat: 30.4413889, lng: 32.3555556, description: 'تقع في منطقة تسمى "" خربة الرطيل "" بقرية الجورة جنوب مدينة رفح بشمال سيناء بمسافة تبلغ حوالى 30 كم، ويذهب بعض الباحثين إلي القول بأنها من بين القلاع التي شيدت خلال العصر الرومانى .' },
  // { id: 4, title: 'قلعة لحفن', lat: 30.4413889, lng: 32.3555556, description: ' تبعد عن مدينة العريش (جنوباً) بمسافة 13 كم تقريباً، ويرجع تاريخ إنشائها الى العصر الرومانى استناداً إلي مادة البناء المستخدمة في تشييد القلعة وبعض الاساسات المتبقية اعلى جبل لحفن، كذلك استناداً إلي الشقاقات الفخارية والقطع الزجاجية الموجودة فوق بعض التلال الأثرية بالمنطقة . ' },
  { id: 5, title: 'متحف التراث السيناوي', lat: 30.851956619816384, lng: 32.312268051696925, description: 'يضم أقساماً متخصصـة فى تراث محافظـة شمال سيناء فى الملبس والمأكل ووسائل الزراعة التقليدية وأدوات الدفاع عن النفس والفلكلور الشعبى ، كما توجد بالمتحف مكتبة وثائقية للتراث المحلى فى شمال سيناء ' },
  { id: 6, title: 'متحف العريش للاثار', lat: 31.213772367538812, lng: 33.82493190455583, description: 'يقع على الطريق الساحلى الدولـى الشمال بمدينة العريش ويضم مجموعة من الأقسام الأثرية المتخصصة التى تجسد تاريخ سيناء من الإنسان الأول مروراً بالعصور المختلفة إلى جانب المقتنيات التراثية المحلية الأصيلة بالإضافة إلى مكتبة متخصصة وقاعة عرض وحديقة متحفية .' },
  { id: 7, title: 'متحف بورسعيد الحربي', lat: 31.269634521180514, lng: 32.29979428055004, description: 'يتكون المتحف الحربي ببور سعيد من عدة قاعات تعرض العديد من المعارك التي خاضها الجيش المصري وشعب بورسعيد. بالإضافة إلى ذلك ، تم توثيق تفاصيل نكسة 1956 وحرب 1967 و 1973 مع إسرائيل .' },
  { id: 8, title: 'متحف اثار الاسماعيله القومي', lat: 30.593038576984814, lng: 32.28373109586933, description: 'يعد من اقدم المتاحف فى مصر شيده المهندسين العاملين فى الشركة العالمية للملاحة البحرية ( هيئة قناة السويس ) عام 1911 ويعتبر أقدم متحف اقليمى فى مصر وطابع المتحف المعمارى يأخذ شكل المعبد  ويتميز بالبوابات والنوافذ التى تعلوها الجعارين أسفل الكورنيش وندرة ما يحتويه من قطع أثرية حيث يضم قطع أثرية لكل العصور بداية من العصر الفرعونى الى عصر محمد على وقد تم افتتاح المتحف للزيارة عام  1913.' },
  { id: 9, title: 'متحف ديليسيبس', lat: 30.590256055469457, lng: 32.27224767282752, description: 'يرجع الى فترة حفر قناة السويس ( 1859 ) كان مقرا لاقامة المهندس الفرنسـى ( فريناند ديليسيبس ) الذى حصل على امتياز حفر قناة السويس من الخديوى اسماعيل ويضم المتحف ادواته ومتعلقاته والرسوم الهندسية والخرائط.' },
  { id: 10, title: 'متحف السويس القومي', lat: 29.986886757191392, lng: 32.56843799834716, description: 'ويحكي قصة مدينة السويس الباسلة من عصور ما قبل التاريخ وحتى العصر الحديث، كما يضم عدداً من الوثائق والصور الزيتية لكل من الخديو سعيد الذي أصدر مرسوماً بإمتياز حفر قناة السويس في الفترة من 1859 في عهد الخديو إسماعيل عام 1869.' },
  { id: 11, title: 'مسجد الوادي المقدس', lat: 28.560697564272985, lng: 33.946923966956476, description: 'يعد مسجد الوادي المقدس بمدينة سانت كاترين من أهم مساجد جنوب سيناء وأشهرها، حيث بني داخل دير سانت كاترين الذي يعد أشهر أديرة العالم وتتعانق مئذنة المسجد مع برج الكنيسة' },
]

// الطرق التاريخية
const locations3 = [
  { id: 1, title: 'طريق الحرب والتجاره الشمالى', lat: 31, lng: 32, description: ' هو طريق حورس الفرعونى , حددت بدايه الطريق عند القنطره شرق تل حبوه حيث الكشف عن أكبر موقع فرعونى فى شمال سيناء والذى عرف فى المصادر الفرعونيه بأسم قلعه "ثارو" وهى المنطقه التى خرجت منها الجيوش لتأمين حدود مصر الشرقيه بدايه من عصر تحتمس الثالث ثم يتجه الطريق شمالا على مقربه من تل الحير وتل الحدوه (مجدول ) ثم بئر رمانه ( قرب المحمديه ) ثم يتجه الى منطقه قاطيه ومنها الى العريش ومنها الى الشيخ زويد ثم رفح وقد ارتبطت بدايه هذا الطريق بوجود فرع نهر النيل (الفرع البيلوزى القديم ) ونظرا لزحف غرود الرمال فى هذه المنطقه اندثرت بعض اثارها خاصه وأنها كانت مراكز حربيه معرضه للهجوم والتخريب دائما' },
  { id: 2, title: 'طريق العائله المقدسه', lat: 30, lng: 32, description: 'ويمتد بطول ساحل البحر المتوسط' },
  { id: 2, title: 'طريق الحج الأسلامى', lat: 29, lng: 32, description: 'يمتد من عجرود غرب السويس مرورا بصحراء التيه حتى نخل ثم العقبه فى اتجاه الأراضى الحجازيه وهو طريق لعبور الحجاج من مصر والمغرب العربى الى الأراضى الحجازيه ' },
]

// الشركات السياحية
const locations4 = [
  { id: 1, title: 'شركة الغمرى للسياحة', lat: 30.594129417627133, lng: 32.27343816392562, description: '٢١١ شارع الحريه حي أول الاسماعيلية' },
  { id: 2, title: 'شركة مصر للسياحة', lat: 31.26098339357472, lng: 32.3114042949125, description: 'ش فلسطين - ش السلطان حسين سابقا، حى الشرق، بور فؤاد، بور سعيد ' },
  { id: 3, title: 'شركة جو شرم تورز', lat: 27.96044307930676, lng: 34.27528374915968, description: 'شارع السوق التجاري القديم، قسم شرم الشيخ، جنوب سيناء ' },
  { id: 4, title: 'شركة الريحان للسياحة', lat: 27.89579037877693, lng: 34.302176127971315, description: 'مستشفى شرم الشيخ الدولى طريق السلام, قسم شرم الشيخ، جنوب سيناء' },
]

export {
  locations1, locations2, locations3, locations4
}
